app/Controllers/Home.php

INSERT INTO `user` (`username`, `password`, `nama`, `role`) VALUES ('admintes2', 'ad77d01e086215047e9b72c8cc6ce973', 'admintes2', 'admin')
---
    public function simpan()
    {
        $username = $this->request->getPost("username");
        $password = $this->request->getPost("password");
        $nama = $this->request->getPost("nama");
        $role = $this->request->getPost("role");

        $user = new User_model();
        $dataUser = $user->find($username);
        if ($dataUser == NULL) {
            //boleh simpan
            $dataInsert = array(
                "username" => $username,
                "password" => md5($password),
                "nama" => $nama,
                "role" => $role,
            );
            $user->insert($dataInsert);