app/Controllers/Register.php

    public function daftar()
    {
        $user = new User_model();
        $validationRules = [
            'username' => 'required|is_unique[user.username]',
            'nama' => 'required|is_unique[user.nama]',
            'password' => 'required|min_length[6]',
        ];

        if (!$this->validate($validationRules)) {
            $data["pesan"] = \Config\Services::validation()->listErrors();
            return view('Register/index', $data);
        }

        // Ambil data dari form pendaftaran
        $username = $this->request->getPost('username');
        $nama = $this->request->getPost('nama');
        $password = $this->request->getPost('password');

        // Simpan data pengguna ke database
        $data = [
            'username' => $username,
            'password' => md5($password),
            // Contoh enkripsi sederhana, sebaiknya gunakan enkripsi yang lebih aman
            'nama' => $nama,
            'role' => 'admin',
            // Atur peran sesuai kebutuhan
        ];

        $user->insert($data);
---
INSERT INTO `user` (`username`, `password`, `nama`, `role`) VALUES ('admin3', '32cacb2f994f6b42183a1300d9a3e8d6', 'admin3', 'admin')